In [1]:
## install ipython-sql
##!conda install -yc conda-forge ipython-sql

## connect to factbook database

In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

## Instructions

Write a query to return information on the tables in the database.

In a different code cell, write and run another query that returns the first five rows of the facts table in the database.

In [3]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [4]:
%%sql
SELECT *
  FROM facts
 LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

## Instructions

Write a single query that returns the following:

* Minimum population
* Maximum population
* Minimum population growth
* Maximum population growth

In [5]:
%%sql
SELECT MIN(population), MAX(population),
       MIN(population_growth), MAX(population_growth)
  FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

## Instructions

Write a query that returns the countries with the minimum population.

Write a query that returns the countries with the maximum population.

In [6]:
%%sql
SELECT name, MIN(population)
  FROM facts;

 * sqlite:///factbook.db
Done.

[('Antarctica', 0)]

In [7]:
%%sql
SELECT name, MAX(population)
  FROM facts;

 * sqlite:///factbook.db
Done.

[('World', 7256490011)]

## Instructions
Recompute the summary statistics you found earlier while excluding the row for the whole world. Include the following:

* Minimum population
* Maximum population
* Minimum population growth
* Maximum population growth

In a different code cell, calculate the average value for the following columns:

* population
* area

In [8]:
%%sql
SELECT MIN(population), MAX(population),
       MIN(population_growth), MAX(population_growth) 
  FROM facts
 WHERE NOT name = 'World';

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

In [9]:
%%sql
SELECT AVG(population), AVG(area)
  FROM facts;

 * sqlite:///factbook.db
Done.

[(62094928.32231405, 555093.546184739)]

## Instructions

Write a query that finds all countries meeting both of the following criteria:
* The population is above average.
* The area is below average.

In [10]:
%%sql
SELECT *
  FROM facts
 WHERE population > (SELECT AVG(population) 
                       FROM facts) AND area < (SELECT AVG(area) 
                                               FROM facts);

 * sqlite:///factbook.db
Done.

[(14, 'bg', 'Bangladesh', 148460, 130170, 18290, 168957745, 1.6, 21.14, 5.61, 0.46),
 (65, 'gm', 'Germany', 357022, 348672, 8350, 80854408, 0.17, 8.47, 11.42, 1.24),
 (85, 'ja', 'Japan', 377915, 364485, 13430, 126919659, 0.16, 7.93, 9.51, 0.0),
 (138, 'rp', 'Philippines', 300000, 298170, 1830, 100998376, 1.61, 24.27, 6.11, 2.09),
 (173, 'th', 'Thailand', 513120, 510890, 2230, 67976405, 0.34, 11.19, 7.8, 0.0),
 (185, 'uk', 'United Kingdom', 243610, 241930, 1680, 64088222, 0.54, 12.17, 9.35, 2.54),
 (192, 'vm', 'Vietnam', 331210, 310070, 21140, 94348835, 0.97, 15.96, 5.93, 0.3)]

## Learn

That's it for the guided steps. Here are some next steps to explore on your own:

* Which country has the most people? Which country has the highest growth rate?
* Which countries have the highest ratios of water to land? Which countries have more water than land?
* Which countries will add the most people to their populations next year?
* Which countries have a higher death rate than birth rate?
* Which countries have the highest population/area ratio, and how does it compare to list we found in the previous screen?

what country has the most people?

In [11]:
%%sql 
SELECT name, Max(population)
  FROM facts  
 WHERE NOT name = 'World';

 * sqlite:///factbook.db
Done.

[('China', 1367485388)]

what country has the highest growth rate?

In [12]:
%%sql 
SELECT name, Max(population_growth)
  FROM facts;

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02)]

What countries have a higher death rate than birth rate?

In [13]:
%%sql 
SELECT name, birth_rate, death_rate
  FROM facts
 WHERE death_rate > birth_rate
 LIMIT 5;

 * sqlite:///factbook.db
Done.

[('Austria', 9.41, 9.42),
 ('Belarus', 10.7, 13.36),
 ('Bosnia and Herzegovina', 8.87, 9.75),
 ('Bulgaria', 8.92, 14.44),
 ('Croatia', 9.45, 12.18)]

What countries have a higher ratio of water to land?

In [14]:
%%sql
SELECT name, (area_water/area_land) AS ratio_water_to_land
  FROM facts
 ORDER BY ratio_water_to_land DESC    
 LIMIT 3

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 905),
 ('Virgin Islands', 4),
 ('Afghanistan', 0)]

What countries will add the most people to their populations next year?

In [15]:
%%sql
SELECT name, population_growth, 
       CAST((population_growth/100) * population AS integer) AS real_growth
 FROM facts
 WHERE NOT name = 'World'
ORDER BY real_growth DESC
LIMIT 5;

 * sqlite:///factbook.db
Done.

[('India', 1.22, 15270686),
 ('China', 0.45, 6153684),
 ('Nigeria', 2.45, 4448270),
 ('Pakistan', 1.46, 2906653),
 ('Ethiopia', 2.89, 2874562)]

Which countries have the highest population/area ratio, and how does it compare to list we found in the previous screen? These countries are most densely populated than the ones on the previous list

In [16]:
%%sql
SELECT name, population, area, (population/area) AS population_area_ratio
  FROM facts
 ORDER BY population_area_ratio DESC    
 LIMIT 3

 * sqlite:///factbook.db
Done.

[('Macau', 592731, 28, 21168),
 ('Monaco', 30535, 2, 15267),
 ('Singapore', 5674472, 697, 8141)]